# 1. Text 
## 1.1. Lấy và in thư mục hiện hành

In [2]:
getwd()

[1] "/home/manhcuong/Documents/CSC_R_for_Data_Science/Chapter 09. Text, CSV, Excel"

## 1.2. Thay đổi thư mục hiện hành

In [3]:
# setwd(<đường dẫn>)

## 1.3. Đọc file text bằng `readLines()`

In [4]:
content = readLines("./data//license.txt")

content

[1] "These data files are derived by splitting up the data set downloaded from:"
[2] "https://www.ontario.ca/data/ontario-public-schools-enrolment"
[3] "under the Open Government License - Ontario:"
[4] "https://www.ontario.ca/page/open-government-licence-ontario"

* Nếu tập tin có dạng UTF-8 thì sử dụng thuộc tính `encoding`

In [5]:
content = readLines("./data/bai_tho.txt", encoding="utf-8")

content

[1] "Mùa xuân là Tết trồng cây"
[2] "Làm cho đất nước càng ngày càng xuân"
[3] ""

In [6]:
content[1]

[1] "Mùa xuân là Tết trồng cây"

## 1.4. Các phương thức
### 1.4.1. Đếm số lượng các element trong vector bằng `length()`

In [7]:
content = readLines("./data//license.txt")

length(content)

[1] 4

### 1.4.2. Đếm số kí tự của từng element trong vector bằng `nchar()`

In [9]:
content = readLines("./data//license.txt")

nchar(content[1])

[1] 74

In [11]:
nchar(content)

[1] 74 60 44 59

### 1.4.3. Kích thước file tính theo `bytes` dùng `file.size()`

In [12]:
file.size("./data/license.txt")

[1] 242

### 1.5. Đọc file text với `scan()`

In [24]:
content = scan("./data/license.txt", "")

content

 [1] "These"
 [2] "data"
 [3] "files"
 [4] "are"
 [5] "derived"
 [6] "by"
 [7] "splitting"
 [8] "up"
 [9] "the"
[10] "data"
[11] "set"
[12] "downloaded"
[13] "from:"
[14] "https://www.ontario.ca/data/ontario-public-schools-enrolment"
[15] "under"
[16] "the"
[17] "Open"
[18] "Government"
[19] "License"
[20] "-"
[21] "Ontario:"
[22] "https://www.ontario.ca/page/open-government-licence-ontario"

## 1.6. Đọc file text có cấu trúc table

In [25]:
df = read.table("./data/Table0.txt")

df

  V1       V2 V3  V4 V5
1 Alex     25 177 57 F
2 Lilly    31 163 69 F
3 Mark     23 190 83 M
4 Oliver   52 179 75 M
5 Martha   76 163 70 F
6 Lucas    49 183 83 M
7 Caroline 26 164 53 F

## 1.7. Ghi chuổi ra file `.txt`

In [1]:
content = "Dương Mạnh Cường"
file_name = file(description="./data/_text.txt", open='a', encoding='utf-8')
write(content, file=file_name)

In [2]:
reading_content = readLines("./data/_text.txt")

reading_content

[1] "Dương Mạnh Cường"

In [3]:
content = matrix(1:9, nrow=3, ncol=3)
write(content, file="./data/_matrix.txt", ncolumns=3, sep=" ")

In [4]:
content = readLines("./data/_matrix.txt")

content

[1] "1 2 3" "4 5 6" "7 8 9"

## 1.8. Ghi dữ liệu text có cấu trúc

In [5]:
df = read.table("./data/Table0.txt")

df

  V1       V2 V3  V4 V5
1 Alex     25 177 57 F
2 Lilly    31 163 69 F
3 Mark     23 190 83 M
4 Oliver   52 179 75 M
5 Martha   76 163 70 F
6 Lucas    49 183 83 M
7 Caroline 26 164 53 F

In [6]:
write.table(df, file="./data/_matrix0.txt", sep="\t")

In [8]:
content = read.table("./data/_matrix0.txt")

content

  V1       V2 V3  V4 V5
1 Alex     25 177 57 F
2 Lilly    31 163 69 F
3 Mark     23 190 83 M
4 Oliver   52 179 75 M
5 Martha   76 163 70 F
6 Lucas    49 183 83 M
7 Caroline 26 164 53 F

# 2. CSV
## 2.1. Đọc file CSV

In [9]:
data = read.csv("./data/emp.csv")

data

  id name     salary start_date dept
1  1 Rick     623.30 2012-01-01 IT
2  2 Dan      515.20 2013-09-23 Operations
3  3 Michelle 611.00 2014-11-15 IT
4  4 Ryan     729.00 2014-05-11 HR
5 NA Gary     843.25 2015-03-27 Finance
6  6 Nina     578.00 2013-05-21 IT
7  7 Simon    632.80 2013-07-30 Operations
8  8 Guru     722.50 2014-06-17 Finance

## 2.2. Phân tích dữ liệu trong file

In [14]:
data = read.csv("./data/emp.csv")

data

  id name     salary start_date dept
1  1 Rick     623.30 2012-01-01 IT
2  2 Dan      515.20 2013-09-23 Operations
3  3 Michelle 611.00 2014-11-15 IT
4  4 Ryan     729.00 2014-05-11 HR
5 NA Gary     843.25 2015-03-27 Finance
6  6 Nina     578.00 2013-05-21 IT
7  7 Simon    632.80 2013-07-30 Operations
8  8 Guru     722.50 2014-06-17 Finance

### 2.2.1. `is.data.frame(<file name>)` kiểm tra file có phải là dataframe hay ko

In [10]:
is.data.frame(data)

[1] TRUE

### 2.2.2. Lấy số cột, số dòng

In [11]:
ncol(data)

[1] 5

In [12]:
nrow(data)

[1] 8

### 2.2.3. `max()`

In [15]:
max(data$salary)

[1] 843.25

### 2.2.4. `mean()`

In [16]:
mean(data$salary)

[1] 656.8813

### 2.2.5. `subset()`

In [17]:
subset(data, salary == max(data$salary))

  id name salary start_date dept
5 NA Gary 843.25 2015-03-27 Finance

In [18]:
retval = subset(data, dept=='IT')

retval

  id name     salary start_date dept
1 1  Rick     623.3  2012-01-01 IT
3 3  Michelle 611.0  2014-11-15 IT
6 6  Nina     578.0  2013-05-21 IT

In [19]:
info = subset(data, salary > 600 & dept == 'IT')

info

  id name     salary start_date dept
1 1  Rick     623.3  2012-01-01 IT
3 3  Michelle 611.0  2014-11-15 IT

In [21]:
retval = subset(data, as.Date(start_date) > as.Date("2014-1-1"))

retval

  id name     salary start_date dept
3  3 Michelle 611.00 2014-11-15 IT
4  4 Ryan     729.00 2014-05-11 HR
5 NA Gary     843.25 2015-03-27 Finance
8  8 Guru     722.50 2014-06-17 Finance

## 2.3. Ghi file `csv`

In [22]:
data = read.csv("./data/emp.csv")

data

  id name     salary start_date dept
1  1 Rick     623.30 2012-01-01 IT
2  2 Dan      515.20 2013-09-23 Operations
3  3 Michelle 611.00 2014-11-15 IT
4  4 Ryan     729.00 2014-05-11 HR
5 NA Gary     843.25 2015-03-27 Finance
6  6 Nina     578.00 2013-05-21 IT
7  7 Simon    632.80 2013-07-30 Operations
8  8 Guru     722.50 2014-06-17 Finance

In [23]:
it_emps = subset(data, dept == 'IT')
write.csv(it_emps, "./data/_it_emps.csv")

In [24]:
new_data = read.csv("./data/_it_emps.csv")

new_data

  X id name     salary start_date dept
1 1 1  Rick     623.3  2012-01-01 IT
2 3 3  Michelle 611.0  2014-11-15 IT
3 6 6  Nina     578.0  2013-05-21 IT

### 2.3.1. Ghi ra file mà ko kèm theo cột index `X`

In [25]:
write.csv(it_emps, "./data/_it_emps0.csv", row.names=FALSE)

In [26]:
new_data = read.csv("./data/_it_emps0.csv")

new_data

  id name     salary start_date dept
1 1  Rick     623.3  2012-01-01 IT
2 3  Michelle 611.0  2014-11-15 IT
3 6  Nina     578.0  2013-05-21 IT

# 3. Excel
* Nếu đã cài đặt `java` từ trc thì cần chạy thêm dòng này ở terminal
```
sudo R CMD javareconf
```
* Để làm việc với tập tin `xls`, `.xlsx` thì cần install thư viện `xlsx` vào.

In [1]:
install.packages("rJava")
install.packages("xlsxjars")
install.packages("xlsx")

Installing package into ‘/home/manhcuong/R/x86_64-pc-linux-gnu-library/4.1’
(as ‘lib’ is unspecified)

Installing package into ‘/home/manhcuong/R/x86_64-pc-linux-gnu-library/4.1’
(as ‘lib’ is unspecified)

Installing package into ‘/home/manhcuong/R/x86_64-pc-linux-gnu-library/4.1’
(as ‘lib’ is unspecified)

* Load package `xlsx` vào để làm việc

In [2]:
library("xlsx")

## 3.1. Đọc file excel bằng `read.xlsx(<file path>, sheetIndex=<thứ tự sheet>)`

In [3]:
data = read.xlsx("./data/emp_data.xlsx", sheetIndex = 1)

data

  id name     salary start_date dept
1 1  Rick     623.30 2012-01-01 IT
2 2  Dan      515.20 2013-09-23 Operations
3 3  Michelle 611.00 2014-11-15 IT
4 4  Ryan     729.00 2014-05-11 HR
5    Gary     843.25 2015-03-27 Finance
6 6  Nina     578.00 2013-05-21 IT
7 7  Simon    632.80 2013-07-30 Operations
8 8  Guru     722.50 2014-06-17 Finance

## 3.2. Dựa vào `sheetName`

In [7]:
data = read.xlsx("./data/emp_data.xlsx", sheetName = "city")

data

  name     city
1 Rick     Seattle
2 Dan      Tampa
3 Michelle Chicago
4 Ryan     Seattle
5 Gary     Houston
6 Nina     Boston
7 Simon    Mumbai
8 Guru     Dallas

## 3.3. Ghi ra file `excel`

In [8]:
data = read.csv("./data/emp.csv")
retval = subset(data, as.Date(start_date) > as.Date("2014-1-1"))

retval

  id name     salary start_date dept
3  3 Michelle 611.00 2014-11-15 IT
4  4 Ryan     729.00 2014-05-11 HR
5 NA Gary     843.25 2015-03-27 Finance
8  8 Guru     722.50 2014-06-17 Finance

In [9]:
write.xlsx(retval, file="./data/_emp_data.xlsx", sheetName = "Sheet1", append=FALSE)

In [10]:
new_data = read.xlsx("./data/_emp_data.xlsx", sheetName = "Sheet1")

new_data

  NA. id name     salary start_date dept
1 3    3 Michelle 611.00 2014-11-15 IT
2 4    4 Ryan     729.00 2014-05-11 HR
3 5   NA Gary     843.25 2015-03-27 Finance
4 8    8 Guru     722.50 2014-06-17 Finance